dakhnod/NRF51-serial-multitool/main.c
    bool read_name_success = false;

    err_code = fds_record_find(FILE_SETTINGS, RECORD_NAME, &record_desc, &ftok);

    if(err_code == FDS_SUCCESS){
        NRF_LOG_DEBUG("found name record\n");
        if (fds_record_open(&record_desc, &flash_record) == FDS_SUCCESS){
            // handle lookup
            
            err_code = sd_ble_gap_device_name_set(&sec_mode,
                                                (const uint8_t *)flash_record.p_data,
                                                strlen(flash_record.p_data));
            APP_ERROR_CHECK(err_code);

            read_name_success = true;

            if (fds_record_close(&record_desc) != FDS_SUCCESS){ 
                NRF_LOG_ERROR("could not close name record\n");
            }
        }else{
            NRF_LOG_ERROR("could not open name record\n");
        }
    }else if(err_code == FDS_ERR_NOT_FOUND){
        NRF_LOG_DEBUG("couldn't find name record\n");
    }else{
        NRF_LOG_DEBUG("fds error: %d\n", err_code);
    }

    if(!read_name_success){
        err_code = sd_ble_gap_device_name_set(&sec_mode,
                                            (const uint8_t *)DEVICE_NAME,
                                            strlen(DEVICE_NAME));
        APP_ERROR_CHECK(err_code);
    }

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_nus    Nordic UART Service structure.
 * @param[in] p_data   Data to be send to UART module.
 * @param[in] length   Length of the data.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_t *p_nus, uint8_t *p_data, uint16_t length)
{
    #ifdef USE_UART
    for (uint32_t i = 0; i < length; i++)
    {
        while (app_uart_put(p_data[i]) != NRF_SUCCESS)
            ;
    }
    #endif
    #ifdef USE_SPI
    uint32_t err_code = nrf_drv_spi_transfer(
        &spi_instance,
        p_data,
        length,
        NULL,
        0
    );
    APP_ERROR_CHECK(err_code);
    #endif
}
/**@snippet [Handling the data received over BLE] */

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t err_code;
    (void)err_code;

    #ifdef USE_DFU
    err_code = dfu_init ();
    APP_ERROR_CHECK (err_code);
    #endif

    #if defined(USE_UART) || defined(USE_SPI)
    ble_nus_init_t nus_init = {
        .data_handler = nus_data_handler
    };
    err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);
    #endif
}

// Simple event handler to handle errors during initialization.
void fds_evt_handler(fds_evt_t const * const p_fds_evt)
{
    switch (p_fds_evt->id)
    {
        case FDS_EVT_INIT:
            if (p_fds_evt->result == FDS_SUCCESS)
            {
                NRF_LOG_DEBUG("fds init success\n");
            }else{
                NRF_LOG_ERROR("fds init error: %d\n", p_fds_evt->result);
            }
            break;
        case FDS_EVT_WRITE:
            if (p_fds_evt->result == FDS_SUCCESS)
            {
                NRF_LOG_DEBUG("fds write success\n");
            }else{
                NRF_LOG_ERROR("fds write error: %d\n", p_fds_evt->result);
            }
            break;
        default:
            break;
    }
}

void filesystem_init(){
    ret_code_t err_code = fds_register(fds_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = fds_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t *p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t err_code;
    ble_conn_params_init_t cp_init = {
        .p_conn_params = NULL,
        .first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY,
        .next_conn_params_update_delay = NEXT_CONN_PARAMS_UPDATE_DELAY,
        .max_conn_params_update_count = MAX_CONN_PARAMS_UPDATE_COUNT,
        .start_on_notify_cccd_handle = BLE_GATT_HANDLE_INVALID,
        .disconnect_on_fail = false,
        .evt_handler = on_conn_params_evt,
        .error_handler = conn_params_error_handler,
    };

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


static void
advertising_start (uint16_t adv_interval)
{
  uint32_t err_code;
  ble_gap_adv_params_t adv_params = {
      .type = BLE_GAP_ADV_TYPE_ADV_IND,
      .p_peer_addr = NULL,
      .fp = BLE_GAP_ADV_FP_ANY,
      .interval = adv_interval,
      .timeout = APP_ADV_TIMEOUT_IN_SECONDS,
  };

  sd_ble_gap_adv_stop ();

  err_code = sd_ble_gap_adv_start (&adv_params);
  APP_ERROR_CHECK (err_code);
}

