dakhnod/NRF51-serial-multitool/main.c
static void on_device_name_write(ble_gatts_evt_write_t *write_evt){
    #define MAX_NAME_LEN 21
    static uint8_t __ALIGN(4) name_str[MAX_NAME_LEN] ;

    uint16_t len;
    ret_code_t err_code;
    err_code = sd_ble_gap_device_name_get(name_str, &len);
    APP_ERROR_CHECK(err_code);

    name_str[len] = 0;

    uint16_t word_count = ceil((len + 1)/ 4.0);

    fds_record_desc_t   record_desc;
    fds_record_chunk_t  record_chunk = {
        .p_data = name_str,
        .length_words = word_count
    };
    fds_record_t        record = {
        .file_id = FILE_SETTINGS,
        .key = RECORD_NAME,
        .data = {
            .num_chunks = 1,
            .p_chunks = &record_chunk
        }
    };
    
    fds_find_token_t    ftok = {0};
    err_code = fds_record_find(FILE_SETTINGS, RECORD_NAME, &record_desc, &ftok);
    if(err_code == FDS_SUCCESS){
        NRF_LOG_DEBUG("updating existing name record\n");
        err_code = fds_record_update(&record_desc, &record);
        APP_ERROR_CHECK(err_code);
        NRF_LOG_DEBUG("new record id: %d \r\n",record_desc.record_id);
    }else{
        NRF_LOG_DEBUG("creating new name record\n");
        err_code = fds_record_write(&record_desc, &record);
        APP_ERROR_CHECK(err_code);
        NRF_LOG_DEBUG("new record id: %d \r\n",record_desc.record_id);
    }
    NRF_LOG_DEBUG("name written to fds\n");
}

/**@brief Function for the application's SoftDevice event handler.
 *
 * @param[in] p_ble_evt SoftDevice event.
 */
static void on_ble_evt(ble_evt_t *p_ble_evt)
{
    uint32_t err_code;

    switch (p_ble_evt->header.evt_id)
    {
    case BLE_GATTS_EVT_WRITE:
        goto start;
    start: ;
        ble_gatts_evt_write_t write_evt = p_ble_evt->evt.gatts_evt.params.write;
        uint16_t uuid = write_evt.uuid.uuid;
        if(uuid == 0x2A00){ // device name uuid
            on_device_name_write(&write_evt);
        }
        break;
    case BLE_GAP_EVT_CONNECTED:
        NRF_LOG_DEBUG("connected\n");
        
        err_code = app_timer_start(uart_send_timer, APP_TIMER_TICKS(5, APP_TIMER_PRESCALER), NULL);
        APP_ERROR_CHECK(err_code);

        m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
        break; // BLE_GAP_EVT_CONNECTED

    case BLE_GAP_EVT_DISCONNECTED:
        NRF_LOG_DEBUG("disconnected\n");
        m_conn_handle = BLE_CONN_HANDLE_INVALID;

        err_code = app_timer_stop(uart_send_timer);
        APP_ERROR_CHECK(err_code);

        advertising_start(APP_ADV_INTERVAL_FAST);
        break; // BLE_GAP_EVT_DISCONNECTED

    case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
        // Pairing not supported
        err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
        APP_ERROR_CHECK(err_code);
        break; // BLE_GAP_EVT_SEC_PARAMS_REQUEST

    case BLE_GATTS_EVT_SYS_ATTR_MISSING:
        // No system attributes have been stored.
        err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
        APP_ERROR_CHECK(err_code);
        break; // BLE_GATTS_EVT_SYS_ATTR_MISSING

    case BLE_GATTC_EVT_TIMEOUT:
        // Disconnect on GATT Client timeout event.
        err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                         BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
        break; // BLE_GATTC_EVT_TIMEOUT

    case BLE_GATTS_EVT_TIMEOUT:
        // Disconnect on GATT Server timeout event.
        err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                         BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
        break; // BLE_GATTS_EVT_TIMEOUT

    case BLE_EVT_USER_MEM_REQUEST:
        err_code = sd_ble_user_mem_reply(p_ble_evt->evt.gattc_evt.conn_handle, NULL);
        APP_ERROR_CHECK(err_code);
        break; // BLE_EVT_USER_MEM_REQUEST

    case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
    {
        ble_gatts_evt_rw_authorize_request_t req;
        ble_gatts_rw_authorize_reply_params_t auth_reply;

        req = p_ble_evt->evt.gatts_evt.params.authorize_request;

        if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID)
        {
            if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ) ||
                (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
                (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL))
            {
                if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
                {
                    auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                }
                else
                {
                    auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
                }
                auth_reply.params.write.gatt_status = APP_FEATURE_NOT_SUPPORTED;
                err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                           &auth_reply);
                APP_ERROR_CHECK(err_code);
            }
        }
    }
    break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST

#if (NRF_SD_BLE_API_VERSION == 3)
    case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
        err_code = sd_ble_gatts_exchange_mtu_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                   NRF_BLE_MAX_MTU_SIZE);
        APP_ERROR_CHECK(err_code);
        break; // BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST
#endif

    default:
        // No implementation needed.
        break;
    }
}

/**@brief Function for dispatching a SoftDevice event to all modules with a SoftDevice
 *        event handler.
 *
 * @details This function is called from the SoftDevice event interrupt handler after a
 *          SoftDevice event has been received.
 *
 * @param[in] p_ble_evt  SoftDevice event.
 */
static void ble_evt_dispatch(ble_evt_t *p_ble_evt)
{
    ble_conn_params_on_ble_evt(p_ble_evt);
    ble_nus_on_ble_evt(&m_nus, p_ble_evt);
    on_ble_evt(p_ble_evt);
    #ifdef USE_DFU
    ble_dfu_on_ble_evt (&dfu, p_ble_evt);
    #endif
}

