dakhnod/NRF51-serial-multitool/main.c
/**@brief Function for the SoftDevice initialization.
 *
 * @details This function initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;

    nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;

    // Initialize SoftDevice.
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

    ble_enable_params_t ble_enable_params;
    err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT,
                                                    PERIPHERAL_LINK_COUNT,
                                                    &ble_enable_params);
    ble_enable_params.common_enable_params.vs_uuid_count = 2;
    APP_ERROR_CHECK(err_code);

    //Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT, PERIPHERAL_LINK_COUNT);

    // Enable BLE stack.
#if (NRF_SD_BLE_API_VERSION == 3)
    ble_enable_params.gatt_enable_params.att_mtu = NRF_BLE_MAX_MTU_SIZE;
#endif
    err_code = softdevice_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Subscribe for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);

    err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}

void uart_send_timeout_handler()
{
    uint32_t err_code;
    uint32_t max_size = BLE_NUS_MAX_DATA_LEN;
    // max_size = 1;
    uint8_t current_byte;
    uint8_t data[max_size];
    uint32_t index = 0;
    while(true){
        uint32_t result = app_uart_get(&current_byte);
        if(result == NRF_ERROR_NOT_FOUND) break;
        data[index++] = current_byte;
        if(index == max_size) break;
    }
    if(index > 0){
        err_code = ble_nus_string_send(&m_nus, data, index);
        (void) err_code;
        // APP_ERROR_CHECK(err_code);
    }
}

/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' i.e '\r\n' (hex 0x0D) or if the string has reached a length of
 *          @ref NUS_MAX_DATA_LENGTH.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t *p_event)
{

    switch (p_event->evt_type)
    {
    case APP_UART_DATA_READY:
        break;

    case APP_UART_COMMUNICATION_ERROR:
        NRF_LOG_ERROR("uart comm error: %d\n", p_event->data.error_communication);
        // APP_ERROR_HANDLER(p_event->data.error_communication);
        break;

    case APP_UART_FIFO_ERROR:
        NRF_LOG_ERROR("uart fifo error: %d\n", p_event->data.error_code);
        APP_ERROR_HANDLER(p_event->data.error_code);
        break;

    default:
        break;
    }
}
/**@snippet [Handling the data received over UART] */

/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
#ifdef USE_UART
static void uart_init(void)
{
    uint32_t err_code;
    const app_uart_comm_params_t comm_params =
        {
            RX_PIN_NUMBER,
            TX_PIN_NUMBER,
            RTS_PIN_NUMBER,
            CTS_PIN_NUMBER,
            APP_UART_FLOW_CONTROL_DISABLED,
            false,
            UART_BAUDRATE_BAUDRATE_Baud115200};

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_MID,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
#endif

#ifdef USE_SPI
static void spi_init(){
    uint32_t err_code;

    nrf_drv_spi_config_t  spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;

    spi_config.sck_pin = SPIM0_SCK_PIN;
    spi_config.mosi_pin = SPIM0_MOSI_PIN;

    err_code = nrf_drv_spi_init(
        &spi_instance,
        &spi_config,
        NULL
    );

    APP_ERROR_CHECK(err_code);
}
#endif

/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void
advertising_init ()
{
  uint32_t err_code;

  ble_advdata_t advdata = {
    .name_type = BLE_ADVDATA_FULL_NAME,
    .include_appearance = false,
    .flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE
  };

  ble_uuid_t m_adv_uuids[] = {
    {0xffe0, BLE_UUID_TYPE_BLE},
    {0x0001, BLE_UUID_TYPE_VENDOR_BEGIN + 1},
  }; /**< Universally unique service identifier. */

  // ble_uuid_t adv_uuids[] = {{LBS_UUID_SERVICE, m_lbs.uuid_type}};
  ble_advdata_t scanrsp = {
    .uuids_complete.uuid_cnt = 2,
    .uuids_complete.p_uuids  = m_adv_uuids
  };

  // sd_ble_gap_appearance_set (BLE_APPEARANCE_GENERIC_THERMOMETER);

  err_code = ble_advdata_set (&advdata, &scanrsp);
  APP_ERROR_CHECK (err_code);
}

/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;

    (void)nus_data_handler;

    NRF_LOG_INIT(NULL);

    NRF_LOG_DEBUG("starting...\n");

    // Initialize.
    APP_TIMER_APPSH_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    err_code = app_timer_create(
        &uart_send_timer,
        APP_TIMER_MODE_REPEATED,
        uart_send_timeout_handler);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEBUG("timer inited\n");
    #ifdef USE_UART
    uart_init();
    NRF_LOG_DEBUG("uart inited\n");
    #endif
    #ifdef USE_SPI
    spi_init();
    NRF_LOG_DEBUG("spi inited\n");
    #endif
    ble_stack_init();
    NRF_LOG_DEBUG("ble stack inited\n");
    filesystem_init();
    NRF_LOG_DEBUG("fds inited\n");
    gap_params_init();
    NRF_LOG_DEBUG("gap inited\n");
    services_init();
    NRF_LOG_DEBUG("services inited\n");
    advertising_init();
    NRF_LOG_DEBUG("advertising inited\n");
    conn_params_init();
    NRF_LOG_DEBUG("conn params inited\n");

    advertising_start(APP_ADV_INTERVAL_FAST);
    NRF_LOG_DEBUG("advertising started\n");

    // Enter main loop.
    for (;;)
    {
        power_manage();
        app_sched_execute();
    }
}

/**
 * @}
 */
